package less.lesson20;

import java.util.HashMap;
import java.util.Iterator;
import java.util.Map;
import java.util.Set;

public class CountLetters {
	private static final String TEXT = "ГЕРБ си поставя за цел минимум пет депутати на евроизборите през май 2014 година.\r\n" + 
			"\r\n" + 
			"Това обяви при откриването на Европейски информационен офис в София на евродепутата Моника Панайотова зам.-председателят на ГЕРБ Цветан Цветанов.\r\n" + 
			"\r\n" + 
			"\"Общинските съветници и районните кметове реализират политиките на местно ниво. Самият факт, че имаме толкова много наши симпатизанти и членове на партията, означава, че ГЕРБ е жива, и че ГЕРБ е първата политическа сила. Надявам се, че на предстоящите важни избори за България – европейските през май 2014 г. – ще имаме най-много европейски депутати, колкото сме имали досега от самото учредяване на партията\", подчерта Цветанов.\r\n" + 
			"\r\n" + 
			"По думите му това означава минимум 5 депутата\r\n" + 
			"\r\n" + 
			"\"Благодаря на Моника Панайотова, че през 2006 година, като представител на неправителствения сектор, тръгна заедно със сдружение ГЕРБ, след което учредихме партия ГЕРБ. Вече 7 години по-късно, Моника Панайотова даде възможността на много млади хора да могат да бъдат реализирани чрез партия ГЕРБ\", отчете той.\r\n" + 
			"\r\n" + 
			"Цветанов подчерта, че Панайотова е успяла да се утвърди, като много добър ръководител на младежката структура на ГЕРБ, което пък дало възможност тя да бъде уважаван партньор в Европейската народна партия.";
	
	public static void main(String[] args) {
		//System.out.println(TEXT);
		Map<Character, Integer> letters = new HashMap<Character, Integer>();
		char[] chars = TEXT.toCharArray();
		for (char c : chars) {
			if(Character.isLetter(c)) {
				if(letters.containsKey(c)) {
					int count = letters.get(c);
					count++;
					letters.put(c, count);
				} else {
					letters.put(c, 1);
				}
			}
		}
		
		Set<Character> set = letters.keySet();
		Iterator<Character> it = set.iterator();
		while(it.hasNext()) {
			char ch = it.next();
			System.out.println(ch + ": " + letters.get(ch));
		}
	}
}
